<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-atj-staging","backend":"f8226cbcc8c587782d5175d54091257c9b7424796db072dfae33b258d4e753f7","plan_job_ref":"Job Post Terraform plan to PR comment #153 at https://github.com/GSA-TTS/atj-platform/actions/runs/10043732751","plan_out_hash":"25997bd77d2881a9a5350be9ee7915a979890dee5f248c9b748a0d04f277e9cd","plan_hash":"ff1aae0b63a0fddb4f83238eead0fd7929f15369dcbbcb89d1c57d8a7b74c81a","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __tts-10x-atj-staging__
<details>
<summary>Plan: 2 to add, 2 to change, 4 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F will be updated in-place
!~  resource "cloudfoundry_app" "tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-app_E0D2137F" {
        id                              = "7b7d0fa8-f5b1-48ba-a320-1dfbcffbd7b5"
!~      id_bg                           = "************************************" -> (known after apply)
        name                            = "tts-10x-atj-staging-server-doj-app"
#        (17 unchanged attributes hidden)

-       routes {
-           port  = 0 -> null
-           route = "5f2eddbb-1011-4cd8-89bf-a01048830b8b" -> null
        }
+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

-       service_binding {
-           params           = (sensitive value) -> null
-           service_instance = "f4d7b511-20cf-47d4-bf25-3bc2a848e8f4" -> null
#            (1 unchanged attribute hidden)
        }
    }

  # cloudfoundry_app.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C will be updated in-place
!~  resource "cloudfoundry_app" "tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-app_0CAEC23C" {
        id                              = "62d635fa-8ea0-47ab-8584-2fa78cfb03d4"
!~      id_bg                           = "************************************" -> (known after apply)
        name                            = "tts-10x-atj-staging-server-kansas-app"
#        (17 unchanged attributes hidden)

-       routes {
-           port  = 0 -> null
-           route = "d99c99cf-ecb3-4885-a5b2-8b95fc3bd1bd" -> null
        }
+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

-       service_binding {
-           params           = (sensitive value) -> null
-           service_instance = "097d925c-7aa5-489b-82df-d50abe38e284" -> null
#            (1 unchanged attribute hidden)
        }
    }

  # cloudfoundry_route.tts-10x-atj-staging-server-doj-route will be created
+   resource "cloudfoundry_route" "tts-10x-atj-staging-server-doj-route" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-atj-staging-server-doj"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
    }

  # cloudfoundry_route.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-route_2BD625AA will be destroyed
  # (because cloudfoundry_route.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-route_2BD625AA is not in configuration)
-   resource "cloudfoundry_route" "tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-route_2BD625AA" {
-       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> null
-       endpoint = "tts-10x-atj-staging-server-doj.app.cloud.gov" -> null
-       hostname = "tts-10x-atj-staging-server-doj" -> null
-       id       = "5f2eddbb-1011-4cd8-89bf-a01048830b8b" -> null
-       space    = "132fc49b-e29e-40b3-8914-4233e4d4caf4" -> null
#        (1 unchanged attribute hidden)
    }

  # cloudfoundry_route.tts-10x-atj-staging-server-kansas-route will be created
+   resource "cloudfoundry_route" "tts-10x-atj-staging-server-kansas-route" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-atj-staging-server-kansas"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "132fc49b-e29e-40b3-8914-4233e4d4caf4"
    }

  # cloudfoundry_route.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-route_B2AB6A20 will be destroyed
  # (because cloudfoundry_route.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-route_B2AB6A20 is not in configuration)
-   resource "cloudfoundry_route" "tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-route_B2AB6A20" {
-       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> null
-       endpoint = "tts-10x-atj-staging-server-kansas.app.cloud.gov" -> null
-       hostname = "tts-10x-atj-staging-server-kansas" -> null
-       id       = "d99c99cf-ecb3-4885-a5b2-8b95fc3bd1bd" -> null
-       space    = "132fc49b-e29e-40b3-8914-4233e4d4caf4" -> null
#        (1 unchanged attribute hidden)
    }

  # cloudfoundry_user_provided_service.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-login-gov-service_65BE8DCD will be destroyed
  # (because cloudfoundry_user_provided_service.tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-login-gov-service_65BE8DCD is not in configuration)
-   resource "cloudfoundry_user_provided_service" "tts-10x-atj-staging-server-doj_tts-10x-atj-staging-server-doj-login-gov-service_65BE8DCD" {
-       credentials = (sensitive value) -> null
-       id          = "f4d7b511-20cf-47d4-bf25-3bc2a848e8f4" -> null
-       name        = "tts-10x-atj-staging-server-doj-login-gov-service" -> null
-       space       = "132fc49b-e29e-40b3-8914-4233e4d4caf4" -> null
-       tags        = [] -> null
    }

  # cloudfoundry_user_provided_service.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-login-gov-service_8ED0FBC7 will be destroyed
  # (because cloudfoundry_user_provided_service.tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-login-gov-service_8ED0FBC7 is not in configuration)
-   resource "cloudfoundry_user_provided_service" "tts-10x-atj-staging-server-kansas_tts-10x-atj-staging-server-kansas-login-gov-service_8ED0FBC7" {
-       credentials = (sensitive value) -> null
-       id          = "097d925c-7aa5-489b-82df-d50abe38e284" -> null
-       name        = "tts-10x-atj-staging-server-kansas-login-gov-service" -> null
-       space       = "132fc49b-e29e-40b3-8914-4233e4d4caf4" -> null
-       tags        = [] -> null
    }

Plan: 2 to add, 2 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #153](https://github.com/GSA-TTS/atj-platform/actions/runs/10043732751)